In [4]:
#pandas 
import pandas as pd
import numpy as np

In [8]:
#series built on numpy top of numpyarray
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
dic  = {'a':10,'b':20,'c' : 30}

In [6]:
labels

['a', 'b', 'c']

In [20]:
series=pd.Series(my_data,labels)

In [26]:
series['a']

10

In [27]:
series

a    10
b    20
c    30
dtype: int64

In [32]:
ser2 = pd.Series(arr)
ser2

0    10
1    20
2    30
dtype: int32

In [33]:
series+ser2#didn't find the match

a   NaN
b   NaN
c   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [36]:
  #DataFrames
from numpy.random import randn

In [37]:
np.random.seed(101)

In [42]:
df = pd.DataFrame(randn(5,4) *10,['A','B','C','D','E'],['W','X','Y','Z'])
df

           W          X          Y          Z
A   3.860303  20.840185  -3.765187   2.303363
B   6.812093  10.351251  -0.311605  19.399323
C -10.051869  -7.417897   1.871245  -7.328451
D -13.829201  14.824955   9.614582 -21.412123
E   9.925735  11.922406 -10.467795  12.927646

In [43]:
df['W']

A     3.860303
B     6.812093
C   -10.051869
D   -13.829201
E     9.925735
Name: W, dtype: float64

In [44]:
df['X']

A    20.840185
B    10.351251
C    -7.417897
D    14.824955
E    11.922406
Name: X, dtype: float64

In [45]:
df[['W','X']]

           W          X
A   3.860303  20.840185
B   6.812093  10.351251
C -10.051869  -7.417897
D -13.829201  14.824955
E   9.925735  11.922406

In [51]:
df['new'] = df['W'] +df['Y']

In [61]:
df.drop('new',axis='columns',inplace = True)

In [62]:
df

           W          X          Y          Z
A   3.860303  20.840185  -3.765187   2.303363
B   6.812093  10.351251  -0.311605  19.399323
C -10.051869  -7.417897   1.871245  -7.328451
D -13.829201  14.824955   9.614582 -21.412123
E   9.925735  11.922406 -10.467795  12.927646

In [76]:
df.drop('C',axis = 'rows')

           W          X         Y          Z
A   3.860303  20.840185 -3.765187   2.303363
B   6.812093  10.351251 -0.311605  19.399323
D -13.829201  14.824955  9.614582 -21.412123

In [80]:
df.shape

(4, 4)

In [92]:
df.loc['C']

W   -10.051869
X    -7.417897
Y     1.871245
Z    -7.328451
Name: C, dtype: float64

In [89]:
df.iloc[2]

W   -10.051869
X    -7.417897
Y     1.871245
Z    -7.328451
Name: C, dtype: float64

In [95]:
df.loc['B','Y']

-0.3116048149309962

In [96]:
#DataFrome 2

In [100]:
booldf = df > 0 #return boolean values
booldf

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False

In [101]:
df[booldf]

          W          X         Y          Z
A  3.860303  20.840185       NaN   2.303363
B  6.812093  10.351251       NaN  19.399323
C       NaN        NaN  1.871245        NaN
D       NaN  14.824955  9.614582        NaN

In [115]:
result=df [df['Z'] > 0] 
result

          W          X         Y          Z
A  3.860303  20.840185 -3.765187   2.303363
B  6.812093  10.351251 -0.311605  19.399323

In [120]:
new =result['X']+result['Y']
new

A    17.074999
B    10.039646
dtype: float64

In [121]:
df

           W          X         Y          Z
A   3.860303  20.840185 -3.765187   2.303363
B   6.812093  10.351251 -0.311605  19.399323
C -10.051869  -7.417897  1.871245  -7.328451
D -13.829201  14.824955  9.614582 -21.412123

In [125]:
df.set_index('W',inplace=True)#

In [129]:
df.reset_index(inplace=True)#

In [137]:
df

           W          X         Y          Z
0   3.860303  20.840185 -3.765187   2.303363
1   6.812093  10.351251 -0.311605  19.399323
2 -10.051869  -7.417897  1.871245  -7.328451
3 -13.829201  14.824955  9.614582 -21.412123

0     3.860303
1     6.812093
2   -10.051869
3   -13.829201
Name: W, dtype: float64

In [142]:
#Missing values 
d = {'A': [1,2,np.nan],'B':[5,np.nan,np.nan],'c':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'c': [1, 2, 3]}

In [144]:
df = pd.DataFrame(d)
df

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [148]:
df.dropna().fillna

     A    B  c
0  1.0  5.0  1

In [149]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [151]:
df.dropna(thresh=2)

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2

In [152]:
df.fillna(value ='Fill value')

            A           B  c
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [154]:
df['A'].fillna(df['A'].mean(),inplace =True)

In [155]:
df

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [156]:
#group By

In [164]:
df.groupby('A').sum()

       B  c
A
1.0  5.0  1
1.5  0.0  3
2.0  0.0  2

In [2]:
#operations
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()#unique values return array
df['col2'].nunique()#to get number of uniue valyes

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
#Data Input and Output
#csv, HTML, Excel,SQL
#pd.read_csv()
#pd.to_csv()

data = pd.read_html('https://www.fdic.gov/transparency/bankapplications.html')

In [9]:
type(data)

list

In [12]:
data[0]

,Disposition,Deposit Insurance,Branch,Change in Control,Merger,Management Change,Total
0,Approved,17,522,20,144,91,794
1,Denied,0,0,0,0,0,0
2,Returned,1,3,2,2,4,12
3,Withdrawn,5,23,4,4,14,50
4,Totals,23,548,26,150,109,856

In [19]:
from sqlalchemy import create_engine

In [ ]:
pd.read_sql('')